JoergOstertag/projects/ESP8266/Wemos-D1-Mini/3D-Scanner/webServer.cpp
#include "config.h"

#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>

#include "htmlFormHandler.h"
#include "resultStorageHandler.h"

#include "positioner.h"
#include "timeHelper.h"
#include "getDistance.h"

#include "sdCardWrite.h"

int graph2DsvgSize = 800;


ESP8266WebServer server(80);

extern unsigned int currentResultArrayIndex;

extern ResultStorageHandler resultStorageHandler;

/**
  void deliverSdCardFile(String fileName) {

  myFile = SD.open(fileName);
  if (myFile) {
    Serial.print("Check " + fileName + "\n");
    server.streamFile(myFile, "text/plain");
    // close the file:
    myFile.close();
  } else {
    // if the file didn't open, print an error:
    Serial.println("error opening test.txt");
  }


  server.chunkedResponseFinalize();
  }
*/

void handleFile() {
  Serial.print("Get File ... ");
  for (int i = 0; i < server.args(); i++) {

    Serial.print("Arg nº" + (String)i + " – > ");
    Serial.print(server.argName(i) + ": ");
    Serial.print( server.arg(i) + "\n");
  }
  //deliverSdCardFile("test.txt");

  Serial.println("DONE");
}

bool handleParameters() {
  bool changes = false;
  changes |= parseParameter(server, "servoPosAzMin",    resultStorageHandler.servoPosAzMin);
  changes |= parseParameter(server, "servoPosAzMax",    resultStorageHandler.servoPosAzMax);
  changes |= parseParameter(server, "servoStepAz",      resultStorageHandler.servoStepAz);

  if ( !servoStepActive) {
    // parseParameter(server, "servoPosEl",    position.az );
    // parseParameter(server, "servoPosAz",    position.el );
  }
  changes |= parseParameter(server, "servoPosElMin",    resultStorageHandler.servoPosElMin);
  changes |= parseParameter(server, "servoPosElMax",    resultStorageHandler.servoPosElMax);
  changes |= parseParameter(server, "servoStepEl",      resultStorageHandler.servoStepEl);


  parseParameter(server, "servoStepActive", servoStepActive);
  parseParameter(server, "preMeasureDelay", preMeasureDelay);
  parseParameter(server, "distanceMaxRetry", distanceMaxRetry);
  parseParameter(server, "distanceNumAveraging", distanceNumAveraging);

  parseParameter(server, "debugPosition", debugPosition);
  parseParameter(server, "debugDistance", debugDistance);
  parseParameter(server, "debugResultPosition", resultStorageHandler.debugResultPosition);



  changes |= parseParameter(server, "servoAzRef1Grad", servoAzRef1Grad );
  changes |= parseParameter(server, "servoAzRef1Pulse", servoAzRef1Pulse );
  changes |= parseParameter(server, "servoAzRef2Grad", servoAzRef2Grad );
  changes |= parseParameter(server, "servoAzRef2Pulse", servoAzRef2Pulse );

  changes |= parseParameter(server, "servoElRef1Grad", servoElRef1Grad  );
  changes |= parseParameter(server, "servoElRef1Pulse", servoElRef1Pulse );
  changes |= parseParameter(server, "servoElRef2Grad", servoElRef2Grad  );
  changes |= parseParameter(server, "servoElRef2Pulse", servoElRef2Pulse );

  changes |= parseParameter(server, "graph2DsvgSize", graph2DsvgSize );

  parseParameter(server, "laserIntensityMax", laserIntensityMax);


  return changes;
}


void deliverDistanceGraph() {
  Serial.print("distanceGraph ... ");

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "image/svg+xml", "");


  char temp[100];
  int width = 900;
  int height = 300;

  {
    String out;
    out.reserve(1000);
    out = "<svg xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\" width=\"";
    out += String(width) + "\" height=\"" + String( height) + "\">\n";

    out += "<rect width=\"" + String(width) + "\" height=\"" + String(height) + "\" fill=\"rgb(250, 230, 210)\" stroke-width=\"1\" stroke=\"rgb(0, 0, 0)\" />\n";
    out += "<g stroke=\"black\">\n";

    server.sendContent(out);
  }

  int y = 0;
  int x = 0;
  int maxVal = 10 + resultStorageHandler.resultMax();

  for ( int i = 0; i < resultStorageHandler.maxValidIndex(); i++) {
    PolarCoordinate position = resultStorageHandler.getPosition(i);
    //    int el = position.el;
    int az = position .az;
    int y2 = resultStorageHandler.getResult(i) * height / maxVal;
    if ( y2 > 0 ) {
      int x2 = (az - resultStorageHandler.servoPosAzMin ) * width / (resultStorageHandler.servoPosAzMax - resultStorageHandler.servoPosAzMin);
      if ( y > 0) {
        if ( az > resultStorageHandler.servoPosAzMin ) {
          sprintf(temp, "<line x1=\"%d\" y1=\"%d\" x2=\"%d\" y2=\"%d\" stroke-width=\"1\" />\n", x, height - y, x2, height - y2);
        }
        server.sendContent(temp);

      }
      y = y2;
      x = x2;
    }
  }
  server.sendContent(F("</g>\n"
                       "</svg>\n"));

  server.chunkedResponseFinalize();
  Serial.println("DONE");
}





void deliverRoomLayoutHtml() {
  Serial.print("deliverRoomLayoutHtml ... ");

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer

  server.send(200, "text/html", F("<html>\n"
                                  "<head>\n"
                                  "  <meta http-equiv='refresh' content='20'/>\n"
                                  "</head>\n"
                                  "<body>\n"));

  server.sendContent(
    // Uptime
    upTimeString() + "<br/>\n"
    "DateTimeString: " + dateTimeString() + "<br/>\n"
    // Show Scan percentage
    + "Scan: " + String(currentResultArrayIndex * 100 / resultStorageHandler.maxIndex() ) + " %<br/>\n"

    "<a href=\"roomLayout.html\">Room Layout:</a><br/>\n"

    "    <img src=\"/roomLayout.svg\" />\n"
    "</body>\n"
    "</html>\n"
    "\n");

  server.chunkedResponseFinalize();
  Serial.println("DONE");

}

void handleRoot() {
  Serial.print("handleRoot ... ");

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "text/html", F("<html>\n"
                                  "<head>\n"
                                  "  <title>3D Scanner</title>\n"
                                  "  <style>\n"
                                  "    body {\n"
                                  "     background-color: #cccccc;\n"
                                  "     font-family: Arial, Helvetica, Sans-Serif;\n"
                                  "     Color: #000088;\n"
                                  "     }\n"
                                  "  </style>\n"
                                  "</head>\n"
                                  "\n"
                                  "<body>\n"
                                  "\n"
                                  "\n"));

  {
    String output ;
    output.reserve(2000);
    output += F("   <div style=\"class:roomLayout; float:left; width:100%; margin:8px;\">\n");
    output += "  <h3><a href=\"/\">ESP8266 3D-Scanner</a></h3>\n";
    {
      // Room Layout img Reference
      output += "\n"
                "      <div style=\"float:left; height:" + String( graph2DsvgSize + 120 ) + "; width:" + String(graph2DsvgSize + 20) + "\">\n"
                "          <iframe height=" + String( graph2DsvgSize + 60) + " width=" + String(graph2DsvgSize + 20) + " src=\"/roomLayout.html\" frameBorder=\"0\"  hspace=\"0\" vspace=\"0\" marginheight=\"0\" ></iframe>\n"
                "      </div>\n";
    }

    server.sendContent(output); output = "";


    // HTML input Form
    server.sendContent(
      F("   <iframe height=300 width=600 src=\"inputForm.html\" name=\"frame_input\"   frameBorder=\"2\"  hspace=\"2\" vspace=\"2\" marginheight=\"0\" ></iframe>\n"
        "   <iframe height=100 width=600 src=\"unknown.html\"   name=\"frame_command\" frameBorder=\"2\"  hspace=\"2\" vspace=\"2\" marginheight=\"0\" ></iframe>\n"
       ));

    // End DIV
    server.sendContent(
      F("</div> \n"
        "\n"
       ));

  } // ... DIV



  // Distances Graf img reference

  server.sendContent(F( "\n"
                        "       < div style = \"float:left; margin:8px;\">\n"
                        "          <p>Distances:<p/>\n"
                        "          <img src=\"/deliverDistanceGraph.svg\" />\n"
                        "       </div>\n"
                        "\n"
                        // html End
                        "\n\n"
                        "  </body>\n"
                        "</html > \n"));

  server.chunkedResponseFinalize();
  Serial.println("DONE");

