JoergOstertag/projects/ESP8266/Wemos-D1-Mini/3D-Scanner/webServer.cpp
}

void handleStartNewScan() {
  Serial.print("handleStartNewScan ... ");
  currentResultArrayIndex = 0;
  resultStorageHandler.resetResults();
  servoStepActive = true;
  server.send(200, "text/html", "<html>New Scan started</html>");
}


void handleInputForm() {
  Serial.print("handleInputForm ... ");

  if (   handleParameters()) {
    resultStorageHandler.resetResults();
    currentResultArrayIndex = 0;
  }

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "text/html", "");
  server.sendContent( F("<html>\n"
                        "<head>\n"
                        "  <title>Parameters</title>\n"
                        "  <style>\n"
                        "    body {\n"
                        "     background-color: #cccccc;\n"
                        "     font-family: Arial, Helvetica, Sans-Serif;\n"
                        "     Color: #000088;\n"
                        "     }\n"
                        "  </style>\n"
                        "</head>\n\n"
                        "\n"
                        "<body>\n"
                        "\n"
                        " <div style=\"text-align:right; margin: 8px;\">\n"));

  // border: 1px solid green;
  server.sendContent( F("   <div style=\"text-align:left; margin:8px; \">\n"
                        "     <form action=\"/inputForm.html\">\n"
                        "      <a href=\"/inputForm.html\">Parameters:</a>\n"
                        "      <input type=\"submit\" value=\"Submit\">\n"
                       ));

  server.sendContent( F("      <table>\n"
                        "        <TR>\n"
                        "            <TD>Az:</TD>"));
  server.sendContent( formString("", "servoPosAzMin",        resultStorageHandler.servoPosAzMin,      ""));
  server.sendContent( formString("", "servoPosAzMax",        resultStorageHandler.servoPosAzMax,      ""));
  server.sendContent( formString("", "servoStepAz",          resultStorageHandler.servoStepAz,        ""));

  server.sendContent( F("         </TR>\n"
                        "\n"
                        "        <TR> <TD>El:</TD>"));
  server.sendContent( formString("", "servoPosElMin",        resultStorageHandler.servoPosElMin,     ""));
  server.sendContent( formString("", "servoPosElMax",        resultStorageHandler.servoPosElMax,     ""));
  server.sendContent( formString("", "servoStepEl",          resultStorageHandler.servoStepEl,     ""));
  server.sendContent(F("      </TR>\n"
                       "\n"
                      ));
  server.sendContent( formString("", "servoStepActive",      servoStepActive,   ""));

  server.sendContent( F( "  </table>\n"));
  String output = "";
  {
    output += "  <div style=\"text-align:left; margin:8px;\">\n";

    // Link to Documentation
    output +=  F("<a href=\"https://github.com/JoergOstertag/projects/blob/master/ESP8266/Wemos-D1-Mini/3D-Scanner/README.md\"  target=\"_blank\">"
                 "Documentation"
                 "</a><br/>\n");

    server.sendContent( F( " <a href=\"/startNewScan\"          target=\"frame_command\"> start New Clean Scan</a><br/>"
                           " <a href=\"/writeToSdCardCsv.cgi\"  target=\"frame_command\"> write csv to SD Card</a><br/>"));

    output += F("      <a href=\"/scan-3D.scad\"        target=\"frame_command\">        scan-3D.scad</a>    <br/>\n\n");
    output += F("      <a href=\"/scan.csv\"            target=\"_blank\">        scan.csv</a>        <br/>\n\n");
    output += F("      <a href=\"/distanceGraph.svg\"   target=\"distanceGraph\"> distanceGraph.svg</a><br/>\n\n");
    output += F("      <a href=\"/configuration.html\"  target=\"configuration\"> configuration.html</a><br/>\n\n");
    output += "   </div>\n\n";
  }
  server.sendContent(output); output = "";


  server.sendContent( F( "    </div>\n\n"
                         "   </div>\n\n"
                         " </body>\n\n"
                         "</html>\n"));
  server.chunkedResponseFinalize();


  Serial.println("DONE");
  server.send(200, "text/html", "<html>handleInputForm Write done</html>");
}

/**
   Separate Frame for input Form
*/
void handleConfigurationHtml() {
  Serial.print("handleConfigurationHtml ... ");

  if (   handleParameters()) {
    resultStorageHandler.resetResults();
    currentResultArrayIndex = 0;
  }

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "text/html", "");
  server.sendContent( F("<html>\n"
                        "<head>\n"
                        "  <title>Parameters</title>\n"
                        "  <style>\n"
                        "    body {\n"
                        "     background-color: #cccccc;\n"
                        "     font-family: Arial, Helvetica, Sans-Serif;\n"
                        "     Color: #000088;\n"
                        "     }\n"
                        "  </style>\n"
                        "</head>\n\n"
                        "\n"
                        "<body>\n"
                        "\n"
                        " <div style=\"text-align:right; margin: 8px;\">\n"));

  // border: 1px solid green;
  server.sendContent( F("   <div style=\"text-align:left; margin:8px; \">\n"
                        "     <form action=\"/configuration.html\">\n"
                        "      <a href=\"/configuration.html\">Configuration:</a>\n"
                        "      <input type=\"submit\" value=\"Submit\">\n"
                       ));

  server.sendContent( F("      <table>\n"
                        "        <TR>\n"
                        "            <TD>Az:</TD>"));

  PolarCoordinate maxPosition = resultStorageHandler.getPosition(resultStorageHandler.maxValidIndex());

  //  server.sendContent( F("         <tr><td><br></td></tr>\n" ));
  server.sendContent( formString("", "servoStepActive",      servoStepActive,   ""));
  if ( ! servoStepActive ) {
    //    server.sendContent( formString("", "servoPosAz",         position.az),     "");
    //    server.sendContent( formString("", "servoPosEl",         position.el),     "");
  }

