JoergOstertag/projects/ESP8266/Wemos-D1-Mini/3D-Scanner/webServer.cpp
  server.sendContent( F("         <tr><td><br></td></tr>\n" ));

  server.sendContent( F("         <tr><td>Distance</td>\n" ) );
  server.sendContent( formString(F("                      <td>pre Measure Delay</td>") ,      "preMeasureDelay",      preMeasureDelay,      F("         </tr>\n")));
  server.sendContent( formString(F("         <tr><TD></TD><td>Max Retry</td>"),               "distanceMaxRetry",     distanceMaxRetry,     F("         </tr>\n")));
  server.sendContent( formString(F("         <tr><TD></TD><td>Num Averaging</td>"),           "distanceNumAveraging", distanceNumAveraging, F("         </tr>\n")));
  server.sendContent( formString(F("         <tr><TD></TD>"),                                 "debugDistance",        debugDistance,        F("         </tr >\n")));
  sensorType2String(sensorType);

  server.sendContent( F("         <tr><td><br></td></tr>\n" ));

  server.sendContent( F("         <tr><td><br>Position: </td > \n" ));
  server.sendContent( formString( F("                       "),                               "debugPosition",        debugPosition,     F("         </tr> ") ));
  server.sendContent( formString( F("         <tr><TD></TD> "),                               "debugResultPosition",  resultStorageHandler.debugResultPosition ,     F(" </tr>\n")));

  server.sendContent( formString( F("         <tr> <TD>Az: </TD> "),                          "servoAzRef1Grad",      servoAzRef1Grad,     ""));
  server.sendContent( formString("",                                                          "servoAzRef1Pulse",     servoAzRef1Pulse,     F("         </tr> \n")));

  server.sendContent( formString( F("         <tr><td></td>"),                                "servoAzRef2Grad",      servoAzRef2Grad,     ""));
  server.sendContent( formString("",                                                          "servoAzRef2Pulse",     servoAzRef2Pulse,     F("         </tr> " )));

  server.sendContent( formString( F("         <tr> <TD>El: </TD> " ),                          "servoElRef1Grad",      servoElRef1Grad,     ""));
  server.sendContent( formString("",                                                          "servoElRef1Pulse",     servoElRef1Pulse,     F("         </tr> \n"  )));
  server.sendContent( formString( F("         <tr><td></td> "),                               "servoElRef2Grad",      servoElRef2Grad,     ""));
  server.sendContent( formString("",                                                          "servoElRef2Pulse",     servoElRef2Pulse,     F("         </tr> ")));

  server.sendContent( formString( F("         <tr><td>graph2D svg Size</td> "),               "graph2DsvgSize", graph2DsvgSize, F("         </tr> ")));

  server.sendContent( formString( F("         <tr><td>laser intensity Max</td> "),            "laserIntensityMax", laserIntensityMax, F("         </tr> ")));

  if ( false ) {
    server.sendContent( F("    <div class = \"slidecontainer\"> \n\n"
                          "          <input type=\"range\" min=\"1\" max=\"100\" value=\"50\" class=\"slider\" id=\"myRange\">\n\n"
                          "    </div>\n\n"));
  }

  server.sendContent( F( "        </table>\n"
                         "     </form><br>\n"

                         "<br/>"));

  server.sendContent( F( "   <table>\n"));
  server.sendContent( "         <tr><td>Max Elevation: </td><td>El: " + String(maxPosition.el)  + " , Az: " + String(maxPosition.az) + "</td></tr>\n");
  server.sendContent( "         <tr><td>servo Num Points Az: </td><td>" + String( resultStorageHandler.servoNumPointsAz()) + "</td></tr>\n");
  server.sendContent( "         <tr><td>servo Num Points El: </td><td>" + String(resultStorageHandler.servoNumPointsEl()) + "</td></tr>\n");
  server.sendContent( "         <tr><td>max Index: </td><td>" + String(resultStorageHandler.maxIndex()) + "</td></tr>\n");
  server.sendContent( "         <tr><td>max Valid Index: </td><td>" + String(resultStorageHandler.maxValidIndex()) + "</td></tr>\n");
  server.sendContent( "         <tr><td>max Available ArrayIndex: </td><td>" + String(resultStorageHandler.maxAvailableArrayIndex) + "</td></tr>\n");
  server.sendContent( F( "  </table>\n"));

  server.sendContent( F( "    </div>\n\n"
                         "   </div>\n\n"
                         " </body>\n\n"
                         "</html>\n"));
  server.chunkedResponseFinalize();


  Serial.println("DONE");
  server.send(200, "text/html", "<html>configurationHtml Write done</html>");
}


/**
   Send Data as CSV
*/
void deliverCSV() {
  Serial.print("deliverCSV ... ");

  String filename = "scan-3D.csv";

  server.sendHeader("Content-Disposition", "attachment; filename=" + filename);

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "text/csv", F("az;el;distance\n"));

  String output;
  output.reserve(2000);

  for ( int i = 0; i < resultStorageHandler.maxValidIndex(); i++) {
    PolarCoordinate position = resultStorageHandler.getPosition(i);

    output = position.az;
    output += ";";
    output += position.el;
    output += ";";
    output += resultStorageHandler.getResult(i);
    output += "\n";

    server.sendContent(output);
  }
  server.chunkedResponseFinalize();
  Serial.println("DONE");
}


/**
   Send Open Scad File to Server connection
*/
void deliverScad() {
  Serial.print(F("deliverScad ... "));

  String filename = "scan-3D.scad";
  server.sendHeader("Content-Disposition", "attachment; filename=" + filename);

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "application/x-openscad",
              F(
                "// ===========================================================\n"
                "// 3D-Scan with Distance Sensor\n"
                "// ===========================================================\n"
                "fov= "));
  server.sendContent( String(distanceFov));
  server.sendContent( F(";\n"
                        "\n"
                        "\n"
                        "\n"
                        "\n"
                       ));

  for ( int i = 0; i < resultStorageHandler.maxValidIndex(); i++) {
    PolarCoordinate position = resultStorageHandler.getPosition(i);

    String output;
    output = "segment(";
    output += "az=";
    output += position.az;
    output += ",\t";

    output += "el=";
    output += position.el;
    output += ",\t";

    output += "dist=";
    output += resultStorageHandler.getResult(i);
    output += ");\n";

    server.sendContent(output);
  }

  server.sendContent( F("\n"
                        "\n"
                        "\n"
                        "module segment(az=0,el=0,dist=20){\n"
                        "if ( dist > 0 ) {\n"
                        "    tanFactor=tan(fov);\n"
                        "    deltaDist= .1;\n"
                        "    dist1= dist-deltaDist;\n"
                        "\n"
                        "      rotate( [el,0,-az] )\n"
                        "        rotate( [-90,0,0] )\n"
                        "          translate([0,0,dist1])\n"
                        "            cylinder( d1= tanFactor*dist1,\n"
                        "                      d2= tanFactor*dist,\n"
                        "                       h= deltaDist );\n"
                        "    }\n"
                        "}\n"
                        "\n"
                        "\n"));
  server.chunkedResponseFinalize();
  Serial.println("DONE");
}



void deliverRoomLayoutSvg() {
  Serial.print("drawRoomLayout ... ");
  char temp[200];

  int height = graph2DsvgSize;
  int width  = graph2DsvgSize;

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);   //Enable Chunked Transfer
  server.send(200, "image/svg+xml", "");

  {
    String out;
    out.reserve(2000);
    out += "<svg xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\" width=\"" + String(width) + "\" height=\"" + String(height) + "\">\n";
    out += "<rect width=\"" + String(width) + "\" height=\"" + String(height) + "\" fill=\"rgb(50, 230, 210)\" stroke-width=\"1\" stroke=\"rgb(0, 0, 0)\" />\n";
    out += "<g stroke=\"black\">\n";
    server.sendContent(out);
  }
  int maxVal = resultStorageHandler.resultMax();

  float grad2Rad = 71.0 / 4068.0;
  int y = -1;
  int x = -1;
  int countValidPoints = 0;
  for ( int i = 0; i < resultStorageHandler.maxValidIndex(); i++) {
    PolarCoordinate position = resultStorageHandler.getPosition(i);
    int el = position.el;
    int az = position .az;

    int dist = resultStorageHandler.getResult(i);
    if (  dist > 0 ) {
      countValidPoints++;
      float rad = grad2Rad * az;
      float distFloor = dist * cos(grad2Rad * el);
      float distPixel = distFloor * max(height, width) / maxVal / 2;
      int y2 = (width / 2)  - cos(rad) * distPixel;
      int x2 = (height / 2) + sin(rad) * distPixel;

