JoergOstertag/projects/ESP8266/Wemos-D1-Mini/3D-Scanner/webServer.cpp
      // Draw circle at endpoints
      sprintf(temp, "  <circle cx=\"%d\" cy=\"%d\" r=\"2\" fill=\"red\" />\n", x2, y2);
      server.sendContent(temp);

      // Draw lines between points
      if ( el > resultStorageHandler.servoPosAzMin) {
        if ( az > 0 && x >= 0 && y >= 0 && x2 >= 0 && y2 >= 0) {
          sprintf(temp, "<line x1=\"%d\" y1=\"%d\" x2=\"%d\" y2=\"%d\" stroke-width=\"1\" />\n", x, y, x2, y2);
          server.sendContent(temp);
        }
      }

      y = y2;
      x = x2;
    }

  }

  { // white centered Coordinate Lines (x and y)
    sprintf(temp, "<line x1=\"%d\" y1=\"0\" x2=\"%d\" y2=\"%d\" stroke=\"white\" stroke-width=\"1\" />\n", width / 2, width / 2, height);
    server.sendContent(temp);
    sprintf(temp, "<line x1=\"0\" y1=\"%d\" x2=\"%d\" y2=\"%d\" stroke=\"white\" stroke-width=\"1\" />\n", height / 2, width, height / 2);
    server.sendContent(temp);
  }

  {
    String out;
    out.reserve(200);
    out = "<text x=\"0\" y=\"15\" fill=\"blue\">max Dist: ";
    out += maxVal;
    out += "</text>\n";

    out += "<text x=\"0\" y=\"35\" fill=\"blue\">ValidPoints: ";
    out += countValidPoints;
    out += "</text>\n";


    server.sendContent(out);
  }

  {
    server.sendContent(F("</g>\n</svg>\n"));
  }

  server.sendContent("");
  server.chunkedResponseFinalize();
  Serial.println("DONE");
}


void handleWriteToSdCardCsv() {
  Serial.println("handleWriteToSdCardCsv");
  sdCardWriteCSV(resultStorageHandler);
  server.send(200, "text/html", "<html>Writing to SD Card Done</html>");
}


void handleNotFound() {
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";

  for (uint8_t i = 0; i < server.args(); i++) {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }

  server.send(404, "text/plain", message);
}



void serverHandleClient() {
  server.handleClient();
}

void initWebserver(ResultStorageHandler & newResultStorageHandler) { // Register URLs to answer
  Serial.print("initWebserver ... ");
  resultStorageHandler = newResultStorageHandler;
  if ( ACTIVATE_WEBSERVER ) {
    // deprecated
    // server.serveStatic("/favicon.png", SPIFFS, "/favicon.png");
    server.on("/", handleRoot);
    server.on("/distanceGraph.svg", deliverDistanceGraph);
    server.on("/scan-3D.scad", deliverScad);
    server.on("/scan.csv", deliverCSV);
    server.on("/roomLayout.svg", deliverRoomLayoutSvg);
    server.on("/roomLayout.html", deliverRoomLayoutHtml);
    server.on("/inputForm.html", handleInputForm);
    server.on("/configuration.html", handleConfigurationHtml);
    server.on("/file", handleFile);
    server.on("/writeToSdCardCsv.cgi", handleWriteToSdCardCsv);
    server.on("/startNewScan", handleStartNewScan);
    server.onNotFound(handleNotFound);
    server.begin();
  }
  Serial.println("HTTP server started");

}
